## Staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                   NAME                    |
|----------|-------------------------------------------|
| recreate | `aws_s3_object.manifest_file`             |
| update   | `aws_quicksight_data_source.s3_sms_usage` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_quicksight_data_source.s3_sms_usage will be updated in-place
  ~ resource "aws_quicksight_data_source" "s3_sms_usage" {
        id             = "239043911459/s3-sms-usage"
        name           = "SMS Usage Data Source"
        tags           = {}
        # (5 unchanged attributes hidden)

      ~ parameters {
          ~ s3 {
              ~ manifest_file_location {
                  ~ key    = "quicksight/s3-manifest-sms-usage-staging.json" -> "quicksight/s3-manifest-sms-usage.json"
                    # (1 unchanged attribute hidden)
                }
            }
        }
    }

  # aws_s3_object.manifest_file must be replaced
-/+ resource "aws_s3_object" "manifest_file" {
      ~ bucket_key_enabled     = false -> (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = jsonencode(
            {
              + fileLocations        = [
                  + {
                      + URIPrefixes = [
                          + "s3://notification-canada-ca-staging-sms-usage-logs-san",
                        ]
                    },
                ]
              + globalUploadSettings = {
                  + containsHeader = "true"
                  + delimiter      = ","
                  + format         = "CSV"
                  + textqualifier  = "'"
                }
            }
        )
      ~ content_type           = "application/octet-stream" -> (known after apply)
      ~ etag                   = "a687d10ac9082c405f228ac19bdbe91d" -> "bc42feb4bc62692f24c7e7327363da78"
      ~ id                     = "quicksight/s3-manifest-sms-usage-staging.json" -> (known after apply)
      ~ key                    = "quicksight/s3-manifest-sms-usage-staging.json" -> "quicksight/s3-manifest-sms-usage.json" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      - source                 = "./s3-manifests/s3-manifest-sms-usage-staging.json" -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

38 tests, 19 passed, 19 warnings, 0 failures, 0 exceptions

```

</details>
